#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Заготовка для программы
# Все блоки комментариев начианющихся с TODO - необходимо заменить на работающие части программы

# TODO - написать функцию считывания данных с последовательного порта

# TODO - написать функцию-парсер, возвращающую идентификатор карты

# TODO - написать функцию отправляющую запрос об идентификаторе на сервер и получающую ответ
#  (в виде заглушки, с авторизацией по моей карте)

# TODO - написать функцию, которая авторизует пользователя (или нет)

# TODO - выявить исключения, с которыми программа падает и написать обработчики для них

# TODO - разбить программу на модули, если требуется

# TODO написать unit-тесты под все это дело, если будет время и желание

# TODO - написать описание программы

# TODO - написать комментарии и документацию к программе
